window.dataLoaded = false;
let title_of_eom = themeOfDEC;
const data = {
    "index_1":{
        "subtitle": "Изучите правила безопасной работы с продоразрушающими инструментами.",
        "step_of_popup": "Изучите правила безопасной работы с продоразрушающими инструментами",
        "paragraph_1":[
            {"image": true, "image_path": "./content/page_content/img1_1.png", "img_sign": " ", "left_img": true},
            {"text": `
                      <b>При работе с породоразрушающим инструментом важно соблюдать правила безопасной работы:</b> 
                     <p> <ol class='ul_custom'>
                        <li>Осмотрите средства индивидуальной защиты (СИЗ): спецодежда, обувь, перчатки, каска, защитные очки.</li>
                        <li>Примените СИЗ.</li>
                        <li>Проверьте наличие и целостность необходимых для работы материалов.</li>
                        <li>Проверьте оснащенность рабочего места необходимым оборудованием, инвентарем и инструментами.</li>
                        <li>При обнаружении неисправностей сообщите ответственному лицу и до устранения неполадок к работе не приступайте.</li>
                        <li>Убедитесь, что рабочее место правильно и безопасно организовано.</li>
                        <li>Подготовьте долото к работе по регламенту.</li>
                        <li>Оцените износ долота, данные занесите в таблицу.</li>
                        <li>Уберите рабочее место.</li>
                      <ol>  </p>`}
        ]
    },
    "index_2":{
        "subtitle": "Изучите назначение и устройство бурового долота с PDC вооружением.",
        "step_of_popup": "Изучите назначение и устройство бурового долота с PDC вооружением",
        "paragraph_1":[
            {"text": "Долота с высококачественным вооружением PDC подходят для большинства условий бурения скважин (в роторном бурении или с забойными двигателями) с высокими показателями проходки на долото, механических скоростей, малыми затратами времени на бурение. В отличие от шарошечных долот с мелкими алмазами, PDC резцы самозатачиваются во время работы и срезают слой породы."}
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/page_content/img2_1.png", "img_sign": " ", "left_img": true},
            {"text": `
                      <b>Устройство долота с PDC резцами</b> 
                     <p> <ol class='ul_custom'>
                        <li>присоединительная резьба</li>
                        <li>центальный промывочный канал</li>
                        <li>упорный торец</li>
                        <li>паз с серийным номером</li>
                        <li>паз под доску отворота</li>
                        <li>калибрующие вставки PDC</li>
                        <li>калибрующая поверхность</li>
                        <li>лопасти</li>
                        <li>резцы PDC</li>
                        <li>калибрующие (шлифованные) резцы PDC</li>
                        <li>плечо</li>
                        <li>торцевая область</li>
                        <li>внутренний конус</li>
                        <li>промывочные отверстия</li>
                        <li>межлопастное пространство</li>
                      <ol>  </p>`}
        ]
    },
    "index_3":{
        "subtitle": "Изучите подготовку долот к работе.",
        "step_of_popup": "Изучите подготовку долот к работе",
        "paragraph_1":[
            {"text": "Порядок оформления долот на буровой представлен на рисунке. Долото поступает на буровую с паспортом, его обрабатывают и буровой мастер заполняет паспорт долота (данные бурового журнала и индикаторной диаграммы), подписывает его и передает с долотом на долотную базу, где данные из паспорта заносят в сводную ведомость."}
        ],
        "paragraph_2":[
            {"image": true, "image_path": "./content/page_content/img3_1.png", "img_sign": "Подготовка долот к работе", "unique":true}
        ],
        "paragraph_3":[
            {"image": true, "image_path": "./content/page_content/img3_2.png", "img_sign": " "}
        ]
    },
    "index_4":{
        "subtitle": "Соотнесите части асинхронного электродвигателя с короткозамкнутым ротором на рисунке с их названиями.",
        "step_of_popup": "Соотнесите части асинхронного электродвигателя с короткозамкнутым ротором на рисунке с их названиями",
        "test": [{
            "type": 3
        }, {
            "image": false,
            "image_path": "./content/video/test_video.mp4"
        }, {
            "answers": ["Каждое долото, доставляемое на буровую, должно иметь серийный номер, паспорт с отметкой о текущем техническом состоянии и текущей наработке.", "При поступлении долота на буровую производится его внешний осмотр и проверяется соответствие номера, указанного на долоте, номеру, указанному в паспорте.", "Проверяется конфигурация и целостность установленных на долоте насадок, сверяется с указанными насадками в паспорте долота.", "Проверяется укомплектованность долота согласно паспорту долота", "Перед спуском в скважину, необходимо внимательно осмотреть долото на наличие возможных повреждений во время его транспортировки или хранения. Следует также осмотреть долото внутри и убедиться в том, что ничего не забьёт насадки. Проверить состояние присоединительной резьбы и упорного уступа"]
        }],
    },
    "index_5":{
        "subtitle": "Изучите классификацию горных пород и соответствующие им типы шарошечных долот.",
        "step_of_popup": "Изучите классификацию горных пород и соответствующие им типы шарошечных долот",
        "paragraph_1": [
            {"text": "Определённый тип долота должен обеспечивать эффективность работы соответствующей группе пород."},
        ],
        "paragraph_2": [
            {"text": `
                <table class='table_new_custom'>
                    <thead>
                        <tr>
                            <th>Тип шарошечных долот</th>
                            <th>Горные породы</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr>
                            <td style='background-color: #EAEFF7'><b>Со стальными зубьями</b></td>
                            <td>
                                <ul>
                                    <li>мягкие</li>
                                    <li>мягкие с пропластками средней твердости</li>
                                    <li>средней твердости</li>
                                    <li>средней твердости с пропластками твердых</li>
                                    <li>твердые</li>
                                    <li>твердые с пропластками крепких</li>
                                </ul>
                            </td>
                        </tr>
                        <tr>
                            <td style='background-color: #EAEFF7'><b>С твердосплавными зубками</b></td>
                            <td>
                                <ul>
                                    <li>мягкие абразивные</li>
                                    <li>мягкие абразивные с пропластками средней твердости</li>
                                    <li>абразивные средней твердости</li>
                                    <li>твердые абразивные</li>
                                    <li>твердые абразивные с пропластками крепких</li>
                                    <li>твердые с пропластками крепких</li>
                                    <li>крепкие</li>
                                    <li>очень крепкие</li>
                                </ul>
                            </td>
                        </tr>
                    </tbody>
                </table>
                `},
        ]
    },
    "index_6":{
        "subtitle": "Установите соответствие между видами шарошечных долот и характеристиками горных пород, для бурения которых они применяются.  Перенесите характеристики  горных пород в соответствующие столбцы таблицы.",
        "step_of_popup": "Установите соответствие между видами шарошечных долот и характеристиками горных пород, для бурения которых они применяются.  Перенесите характеристики  горных пород в соответствующие столбцы таблицы",
        "test": [{
            "type": 7
        }, {
            "anwserArr2": ['мягкие', 'мягкие с пропластками средней твердости', 'средней твердости', 'средней твердости с пропластками твердых', 'твердые', 'твердые с пропластами крепких', 'мягкие абразивные', 'мягкие абразивные с пропластками средней твердости', 'абразивные средней твердости', 'твердые абразивные', 'твердые абразивные с пропластками крепких', 'крепкие', 'очень крепкие']
        }, {
            "answersInCol": [['мягкие', 'мягкие с пропластками средней твердости', 'средней твердости', 'средней твердости с пропластками твердых', 'твердые', 'твердые с пропластами крепких'], ['мягкие абразивные', 'мягкие абразивные с пропластками средней твердости', 'абразивные средней твердости', 'твердые абразивные', 'твердые абразивные с пропластками крепких', 'крепкие', 'очень крепкие']]
        }, {
            "columns": ['Шарошечные долота со стальными зубьями', 'Шарошечные долота с твердосплавными зубками']
        }],
    },
    "index_7":{
        "subtitle": "Изучите схемы включения асинхронного двигателя в сеть.",
        "step_of_popup": "Изучите схемы включения асинхронного двигателя в сеть",
        "paragraph_1": [
            {"text": `<p>Стандарт ГОСТ 20692-2003 распространяется на шарошечные долота для сплошного бурения скважин. Различают три вида долот: одно- (I), двух- (II) и трехшарошечные (III).  Долота классифицируют по типам твёрдости разбуриваемой породы, по расположению и конструкции промывочных и продувных узлов (каналов), по опорам шарошек.</p>
                <p><b>Условное обозначение шарошечных долот по ГОСТ 20692-2003</b></p>
                `} 
        ],
        "paragraph_2": [
            {"image": true, "image_path": "./content/page_content/img7_1.png", "img_sign": " ", "unique": true}
        ]
    },
    "index_8":{
        "subtitle": "Установите соответствие между видами шарошечных долот и их обозначениями.",
        "step_of_popup": "Установите соответствие между видами шарошечных долот и их обозначениями",
        "test": [{
            "type": 7
        }, {
            "anwserArr2": ['М', 'МЗ', 'МС', 'МСЗ', 'С', 'СЗ', 'СТ', 'Т', 'ТЗ', 'ТК', 'ТКЗ', 'К', 'ОК']
        }, {
            "answersInCol": [['М', 'МС', 'С', 'СТ', 'Т', 'ТК'], ['МЗ', 'МСЗ', 'СЗ', 'ТЗ', 'ТКЗ', 'К', 'ОК']]
        }, {
            "columns": ['Со стальными зубьями', 'С твердосплавными зубками']
        }],
    },
    "index_9":{
        "subtitle": "Изучите условное обозначение шарошечных долот по коду Американского нефтяного института (API).",
        "step_of_popup": "Изучите условное обозначение шарошечных долот по коду Американского нефтяного института (API)",
        "paragraph_1": [
            {"text": "Согласно стандарту Американского нефтяного института (API) условное обозначение долот шарошечных содержит серию и тип вооружения, конструкцию типа опор, дополнительные характеристики, которые уточняют герметизацию опор, формы зубков, расположение и наличие, разновидность насадок."},
            {"text": `<p style='text-align: center;'><b>Условное обозначение долот по коду API</b></p>
                <table class='table_new_custom'>
                    <thead>
                        <tr>
                            <th>7</th>
                            <th>4</th>
                            <th>2</th>
                            <th>Y</th>
                        </tr>
                    </thead>
                    <tbody>
                        <tr style='background-color: #44546A; color: #FFFFFF; text-align: center;'>
                            <td>серия вооружения <br> (1-9)</td>
                            <td>тип вооружения <br> (1-4)</td>
                            <td>конструкция опоры <br> (1-7)</td>
                            <td>дополнительные характеристики <br> (A, B, C, …… Z)</td>
                        </tr>
                        <tr style='background-color: #EAEFF7'>
                            <td style='background-color: #EAEFF7'>1-3 – с фрезерованным вооружением <br> 4-9 – с твердосплавным вооружением</td>
                            <td>«1» – для наиболее мягких ГП <br>
                                «4» – для наиболее твёрдых ГП</td>
                            <td>1 – открытая (негерметизированная) <br>
                                2 – открытая с продувкой воздухом  <br>
                                3 – открытая с твердосплавными вставками на калибрующих поверхностях шарошек <br>
                                4 – герметизированная на подшипниках качения <br>
                                5 – герметизированная на подшипниках качения с твердосплавными вставками на калибрующих поверхностях шарошек <br>
                                6 – герметизированная на подшипниках скольжения <br>
                                7 – герметизированная на подшипниках скольжения с твердосплавными вставками на калибрующих поверхностях шарошек <br>
                                8-9 – резервные, для возможного применения в будущем</td>
                            <td>A – с продувкой воздухом <br>
                                B – герметизированная опора, спец. конструкция уплотнений <br>
                                C – центральная насадка <br>
                                D – специальная конструкция вооружения, минимизирующая отклонение ствола <br>
                                E – удлинённые насадки <br>
                                G – усиленная защита козырьков лап наплавкой или твердосплавными зубками <br>
                                H – для направленного или горизонтального бурения <br>
                                … <br>
                                Y – зубки конической формы <br>
                                Z – другие формы зубков</td> 
                        </tr>
                    </tbody>
                </table>
                `},
        ]
    },
    "index_10":{
        "subtitle": "Установите соответствие между условными обозначениями шарошечных долот по коду Американского нефтяного института (API), ГОСТ 20692 - 2003 и их расшифровкой.",
        "step_of_popup": "Установите соответствие между условными обозначениями шарошечных долот по коду Американского нефтяного института (API), ГОСТ 20692 - 2003 и их расшифровкой",
        "test": [{
            "type": 7
        }, {
            "anwserArr2": ['трехшарошечное долото диаметром 215,9 мм для бурения абразивных пород средней твердости (СЗ)', 'с боковой гидромониторной промывкой (Г)', 'на двух или более радиальных подшипниках скольжения с одним или более упорным подшипником скольжения и герметизацией опоры (АУ)', 'Долото с твердосплавным вооружением (7)', 'для наиболее твердых пород (4)', 'с открытой опорой с продувкой воздухом (2)', 'с зубками конической формы (Y)']
        }, {
            "answersInCol": [['трехшарошечное долото диаметром 215,9 мм для бурения абразивных пород средней твердости (СЗ)', 'с боковой гидромониторной промывкой (Г)', 'на двух или более радиальных подшипниках скольжения с одним или более упорным подшипником скольжения и герметизацией опоры (АУ)'], ['Долото с твердосплавным вооружением (7)', 'для наиболее твердых пород (4)', 'с открытой опорой с продувкой воздухом (2)', 'с зубками конической формы (Y)']]
        }, {
            "columns": ['Долото шарошечное III 215,9 СЗ-ГАУ', '742Y']
        }],
    },
    "index_11":{
        "subtitle": "Изучите классификацию долот PDC по коду IADC (Международная ассоциация буровых подрядчиков).",
        "step_of_popup": "Изучите классификацию долот PDC по коду IADC (Международная ассоциация буровых подрядчиков)",
        "paragraph_1": [
            {"text": `
                <p>По стандарту Международной ассоциации буровых подрядчиков долота PDC классифицируют и подбирают по типу корпуса, по разрушаемым горным породам, по диаметру резцов, по типу профиля долота (табл.)</p>
                <p>
                <b class='blue_header'>Таблица. Классификация долот PDC</b>
                </p>
                `},
        ],
        "paragraph_2": [
            {"image": true, "image_path": "./content/page_content/img11_1.png", "img_sign": " ", "unique": true}
        ],
    },
    "index_12":{
        "subtitle": "Расшифруйте условные обозначения долот, классифицируемых по типу корпуса и разбуриваемой горной породе.",
        "step_of_popup": "Расшифруйте условные обозначения долот, классифицируемых по типу корпуса и разбуриваемой горной породе",
        "test":[
            {"type": 9},
            {"description": " "},
            {"definitions": [
                "М1",
                "М4",
                "S3",
                "S2"
            ]},
            {"answers": [
                "Корпус матричный для очень мягких пород",
                "Корпус стальной для мягких средних пород",
                "Корпус матричный для пород средней твердости",
                "Корпус стальной для мягких пород"
            ]},
            {"correct_answer_type_10": [1, 3, 2, 4]},
            {"image": true, "image_path": "./content/empty_img.png", "image_sgn": " ."}
        ],
    },
    "index_13":{
        "subtitle": "Изучите варианты исполнения PDC долот.",
        "step_of_popup": "Изучите варианты исполнения PDC долот",
        "paragraph_1": [
            {"text": "PDC долотам в зависимости от его элемента – основное или второй ряд вооружения, промывка, корпус, резьба – присваивается  буквенное обозначение исполнения (рисунок, таблица)."},
            {"text": "<b class='blue_header'>Таблица. Исполнение PDC долот</b>"}
        ],
        "paragraph_2": [
            {"image": true, "image_path": "./content/page_content/img13_1.png", "img_sign": " ", "unique": true}
        ],
    },
    "index_14":{
        "subtitle": "Сгруппируйте  буквенные обозначения (исполнение) долота по основному вооружению, второму ряду вооружения и калибрующей части.",
        "step_of_popup": "Сгруппируйте  буквенные обозначения (исполнение) долота по основному вооружению, второму ряду вооружения и калибрующей части",
        "test": [{
            "type": 7
        }, {
            "anwserArr2": ['«Т»', '«У»', '«Е»', '«О»', '«С»', '«В»', '«А»', '«X»']
        }, {
            "answersInCol": [['«Т»', '«У»'], ['«Е»', '«О»', '«С»'], ['«В»', '«А»', '«X»']]
        }, {
            "columns": ['Основное вооружение', 'Второй ряд вооружения', 'Калибрующая часть']
        }],
    },
    "index_15":{
        "subtitle": "Ознакомьтесь с испытанием работы электродвигателя на холостом ходу и испытанием возбудителей.",
        "step_of_popup": "Ознакомьтесь с испытанием работы электродвигателя на холостом ходу и испытание возбудителей",
        "test":[
            {"type": 2},
            {"description": `На ресурс работы забойного двигателя и механическую скорость бурения влияет конфигурация и количество гидравлических насадок долота. Нарушение их компоновки может привести и к размыву корпуса долота и выпадению резцов.<br>
                             Ознакомьтесь со справочными данными подбора количества насадок в зависимости от суммарной площади их проходного сечения и определите необходимое количество насадок, если ее диаметр 9,5 мм, а суммарная площадь (мм<sup>2</sup>) проходного сечения насадок – 356,1 мм<sup>2</sup>.
                            <br>
                             
                             <img style='width:95%' src='./content/tests_content/15_01.png'> <br>
            `},
            {"test_with_text_2":
                `<b>Ответ:</b> {=5} насадок<br>`},
            {"image": false, "image_path": "./content/page_content/empty_img.png"}
        ],
    },
        "index_16": {
        "subtitle": "Изучите описание износа долот PDC по стандарту IADC.",
        "step_of_popup": "Изучите описание износа долот PDC по стандарту IADC",
        "paragraph_1": [
            {"text": `<p>Для характеристики физического состояния долот PDC по стандарту IADC стандартизируют их описание, которое приведено в таблице. После каждого подъёма ПРИ на поверхность оценивают состояние резцов. Их делят на две группы – внутренние и внешние (рисунок). Контроль размеров долот проводят с применением универсальных или специальных средств измерений. Диаметр долот контролируют с помощью предельных калибров-колец.</p>
                <p><b class='blue_header'>Таблица. Коды износа резцов</b></p>
                `} 
        ],
        "paragraph_2": [
            {"image": true, "image_path": "./content/page_content/img16_01.png", "img_sign": " ", "unique": true}
        ]
    },
        "index_17": {
        "subtitle": "Установите соответствие между кодом износа резцов и их описанием.",
        "step_of_popup": "Установите соответствие между кодом износа резцов и их описанием",
        "test":[
            {"type": 9},
            {"description": " "},
            {"definitions": [
                "WT",
                "ВТ",
                "LN",
                "LT",
                "СТ",
                "PN"
            ]},
            {"answers": [
                "Износ резцов",
                "Потеря насадки",
                "Сломанные зубки/резцы",
                "Потеря резцов",
                "Закупорка насадок",
                "Дробление/сколы резцов"
            ]},
            {"correct_answer_type_10": [1, 3, 2, 4, 6, 5]},
            {"image": true, "image_path": "./content/empty_img.png", "image_sgn": " ."}
        ],
    },
        "index_18": {
        "subtitle": "Изучите правильность проведения оценки износа долот по стандарту IADC.",
        "step_of_popup": "Изучите правильность проведения оценки износа долот по стандарту IADC",
        "paragraph_1": [
            {"image": true, "image_path": "./content/page_content/img18_1.png", "img_sign": "Рисунок. Обозначения износа долот"},
            {"text": `
                     <p>В зависимости от профиля долота, месторасположения поверхности износа (С – внутренняя конусная, N – торцевая,  T – наружная конусная,  S – плечевая,  G – калибрующая, A – вся площадь долота), зон его распределения (внутренние или внешние резцы), степени износа резца (0-8) заполняют таблицу (рис.).
                     </p>
                     <p><b class='blue_header'> 1 и 2</b> колонки заполняют по таблице элементов долота и исполнению (0-8), <br><br>
                           <b class='blue_header'>3</b> – таблица кодов износа,  <br><br>
                            <b class='blue_header'>4</b> –  месторасположение основного износа, <br><br>
                           <b class='blue_header'>5</b> – не заполняют, <br><br>
                           <b class='blue_header'> 6</b> – значение измеренного диаметра калибр-кольцом,<br><br>
                           <b class='blue_header'> 7</b> – месторасположение вторичного износа, <br><br>
                            <b class='blue_header'>8</b> – таблица причин износа  (рис.) <br><br>
                     </p>
                     <p>
                        В случае возникновения инцидентов с породоразрушающим инструментом расследование причин проводится совместно обеими сторонами (производитель и потребитель) на основании данных станции ГТИ. В буровых бригадах, где нет станции ГТИ, претензии не рассматриваются.
                     </p>`}
        ],
        "paragraph_2": [
            {"text": `<br>
                <p><b class='blue_header'>Таблица. Оформление износа долот по IADC</b><p>`}
        ],
        "paragraph_3": [
            {"image": true, "image_path": "./content/page_content/img18_2.png", "img_sign": " "}
        ]
    },
        "index_19": {
        "subtitle": "Установите соответствие между характером износа долота и его условным обозначением.",
        "step_of_popup": "Установите соответствие между характером износа долота и его условным обозначением",
        "test":[
            {"type": 9},
            {"description": " "},
            {"definitions": [
                "LN",
                "WT",
                "BT",
                "CT",
                "PN",
                "LT"
            ]},
            {"answers": [
                "Износ резцов",
                "Потеря насадки",
                "Сломанные зубки/резцы",
                "Потеря резцов",
                "Закупорка насадок",
                "Сколы/дробление резцов"
            ]},
            {"correct_answer_type_10": [2, 1, 3, 6, 5, 4]},
            {"image": true, "image_path": "./content/empty_img.png", "image_sgn": " ."}
        ],
    },
    "index_20": {
        "subtitle": "Результаты",
        "step_of_popup": "Результаты",
        "result": []
    }
}
window.dataLoaded = true;